Revit 2026 API

# ProjectLocationGetSiteLocation Method

---

Gets the site location to which this project location refers.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SiteLocation GetSiteLocation()
```
```vb
Public Function GetSiteLocation As SiteLocation
```
```cpp
public:
SiteLocation^ GetSiteLocation()
```
```fsharp
member GetSiteLocation : unit -> SiteLocation
```

#### Return Value

SiteLocation

The site location object contains the longitude, latitude, and time-zone of the entire project site.

#### Reference

ProjectLocation Class

Autodesk.Revit.DB Namespace